# Hash 哈希
几乎所有的主流编程语言都提供了哈希（hash）类型，它们的叫法可能是哈希、字典、关联数组、映射等。在 Redis 中，哈希类型指值本身又是一个键值对结构，形如 key = "key", value ={{field1, value1}, ...{fieldN, valueN}}，Redis 键值对和哈希类型二者的关系可以用下图来表示。

![在这里插入图片描述](https://i-blog.csdnimg.cn/direct/6590ec1f69034db681ba149ba5b541e4.png)


❗ 哈希类型中的映射关系通常称为 field - value，用于区分 Redis 整体的键值对（key - value），注意这里的 value 是指 field 对应的 value，不是键（key）对应的值，请注意 value 在不同上下文的作用。

## 命令
### HSET
- **功能**：设置 hash 中指定的字段（field）的值（value）。
- **语法**：HSET key field value [field value ...]
- **命令有效版本**：2.0.0 之后
- **时间复杂度**：插入一组 field 为 O(1)，插入 N 组 field 为 O(N)
- **返回值**：添加的字段的个数。
- **示例**：
```
redis> HSET myhash field1 "Hello"
(integer) 1
redis> HGET myhash field1
"Hello"
```

### HGET
- **功能**：获取 hash 中指定字段的值。
- **语法**：HGET key field
- **命令有效版本**：2.0.0 之后
- **时间复杂度**：O(1)
- **返回值**：字段对应的值或者 nil。
- **示例**：
```
redis> HSET myhash field1 "foo"
(integer) 1
redis> HGET myhash field1
"foo"
redis> HGET myhash field2
(nil)
```

### HEXISTS
- **功能**：判断 hash 中是否有指定的字段。
- **语法**：HEXISTS key field
- **命令有效版本**：2.0.0 之后
- **时间复杂度**：O(1)
- **返回值**：1 表示存在，0 表示不存在。
- **示例**：
```
redis> HSET myhash field1 "foo"
(integer) 1
redis> HEXISTS myhash field1
(integer) 1
redis> HEXISTS myhash field2
(integer) 0
```

### HDEL
- **功能**：删除 hash 中指定的字段。
- **语法**：HDEL key field [field ...]
- **命令有效版本**：2.0.0 之后
- **时间复杂度**：删除一个元素为 O(1)，删除 N 个元素为 O(N)。
- **返回值**：本次操作删除的字段个数。
- **示例**：
```
redis> HSET myhash field1 "foo"
(integer) 1
redis> HDEL myhash field1
(integer) 1
redis> HDEL myhash field2
(integer) 0
```

### HKEYS
- **功能**：获取 hash 中的所有字段。
- **语法**：HKEYS key
- **命令有效版本**：2.0.0 之后
- **时间复杂度**：O(N)，N 为 field 的个数。
- **返回值**：字段列表。
- **示例**：
```
redis> HSET myhash field1 "Hello"
(integer) 1
redis> HSET myhash field2 "World"
(integer) 1
redis> HKEYS myhash
1) "field1"
2) "field2"
```

### HVALS
- **功能**：获取 hash 中的所有的值。
- **语法**：HVALS key
- **命令有效版本**：2.0.0 之后
- **时间复杂度**：O(N)，N 为 field 的个数。
- **返回值**：所有的值。
- **示例**：
```
redis> HSET myhash field1 "Hello"
(integer) 1
redis> HSET myhash field2 "World"
(integer) 1
redis> HVALS myhash
1) "Hello"
2) "World"
```

### HGETALL
- **功能**：获取 hash 中的所有字段以及对应的值。
- **语法**：HGETALL key
- **命令有效版本**：2.0.0 之后
- **时间复杂度**：O(N)，N 为 field 的个数。
- **返回值**：字段和对应的值。
- **示例**：
```
redis> HSET myhash field1 "Hello"
(integer) 1
redis> HSET myhash field2 "World"
(integer) 1
redis> HGETALL myhash
1) "field1"
2) "Hello"
3) "field2"
4) "World"
```

### HMGET
- **功能**：一次获取 hash 中多个字段的值。
- **语法**：HMGET key field [field ...]
- **命令有效版本**：2.0.0 之后
- **时间复杂度**：只查询一个元素为 O(1)，查询多个元素为 O(N)，N 为查询元素个数。
- **返回值**：字段对应的值或者 nil。
- **示例**：
```
redis> HSET myhash field1 "Hello"
(integer) 1
redis> HSET myhash field2 "World"
(integer) 1
redis> HMGET myhash field1 field2 nofield
1) "Hello"
2) "World"
3) (nil)
```

💡 在使用 HGETALL 时，如果哈希元素个数比较多，会存在阻塞 Redis 的可能。如果开发人员只需要获取部分 field，可以使用 HMGET，如果一定要获取全部 field，可以尝试使用 HSCAN 命令，该命令采用渐进式遍历哈希类型，HSCAN 会在后续章节介绍。 

### HLEN
- **功能**：获取hash中的所有字段的个数。
- **语法**：HLEN key
- **命令有效版本**：2.0.0之后
- **时间复杂度**：O(1)
- **返回值**：字段个数。
- **示例**：
```
redis> HSET myhash field1 "Hello"
(integer) 1
redis> HSET myhash field2 "World"
(integer) 1
redis> HLEN myhash
(integer) 2
```

### HSETNX
- **功能**：在字段不存在的情况下，设置hash中的字段和值。
- **语法**：HSETNX key field value
- **命令有效版本**：2.0.0之后
- **时间复杂度**：O(1)
- **返回值**：1表示设置成功，0表示失败。
- **示例**：
```
redis> HSETNX myhash field "Hello"
(integer) 1
redis> HSETNX myhash field "World"
(integer) 0
redis> HGET myhash field
"Hello"
```

### HINCRBY
- **功能**：将hash中字段对应的数值添加指定的值。
- **语法**：HINCRBY key field increment
- **命令有效版本**：2.0.0之后
- **时间复杂度**：O(1)
- **返回值**：该字段变化之后的值。
- **示例**：
```
redis> HSET myhash field 5
(integer) 1
redis> HINCRBY myhash field 1
(integer) 6
redis> HINCRBY myhash field -1
(integer) 5
redis> HINCRBY myhash field -10
(integer) -5
```

### HINCRBYFLOAT
- **功能**：HINCRBY的浮点数版本。
- **语法**：HINCRBYFLOAT key field increment
- **命令有效版本**：2.6.0之后
- **时间复杂度**：O(1)
- **返回值**：该字段变化之后的值。
- **示例**：
```
redis> HSET mykey field 10.50
(integer) 1
redis> HINCRBYFLOAT mykey field 0.1
"10.6"
redis> HINCRBYFLOAT mykey field -5
"5.6"
redis> HSET mykey field 5.0e3
(integer) 0
redis> HINCRBYFLOAT mykey field 2.0e2
"5200"
```

## 总结
下表是哈希类型命令的效果、时间复杂度，开发人员可以参考此表，结合自身业务需求和数据大小选择合适的命令。
| 命令 | 执行效果 | 时间复杂度 |
| ---- | ---- | ---- |
| hset key field value | 设置值 | O(1) |
| hget key field | 获取值 | O(1) |
| hdel key field [field ...] | 删除field | O(k)，k是field个数 |
| hlen key | 计算field个数 | O(1) |
| hgetall key | 获取所有的field-value | O(k)，k是field个数 |
| hmget field [field ...] | 批量获取field-value | O(k)，k是field个数 |
| hexists key field | 判断field是否存在 | O(1) |
| hkeys key | 获取所有的field | O(k)，k是field个数 |
| hvals key | 获取所有的value | O(k)，k是field个数 |
| hsetnx key field value | 设置值，但必须在field不存在时才能设置成功 | O(1) |
| hincrby key field n | 对应field-value +n | O(1) |
| hincrbyfloat key field n | 对应field-value +n | O(1) |
| hstrlen key field | 计算value的字符串长度 | O(1) |

## 内部编码
哈希的内部编码有两种：
- **ziplist（压缩列表）**：当哈希类型元素个数小于hash-max-ziplist-entries配置（默认512个）、同时所有值都小于hash-max-ziplist-value配置（默认64字节）时，Redis会使用ziplist作为哈希的内部实现，ziplist使用更加紧凑的结构实现多个元素的连续存储，所以在节省内存方面比hashtable更加优秀。
- **hashtable（哈希表）**：当哈希类型无法满足ziplist的条件时，Redis会使用hashtable作为哈希的内部实现，因为此时ziplist的读写效率会下降，而hashtable的读写时间复杂度为O(1)。

下面的示例演示了哈希类型的内部编码，以及响应的变化。
1. 当field个数比较少且没有大的value时，内部编码为ziplist：
```
127.0.0.1:6379> hmset hashkey f1 v1 f2 v2
OK
127.0.0.1:6379> object encoding hashkey
"ziplist"
```
2. 当有value大于64字节时，内部编码会转换为hashtable：
```
127.0.0.1:6379> hset hashkey f3 "one string is bigger than 64 bytes ... 省略..."
OK
127.0.0.1:6379> object encoding hashkey
"hashtable"
```
3. 当field个数超过512时，内部编码也会转换为hashtable：
```
127.0.0.1:6379> hmset hashkey f1 v1 h2 v2 f3 v3 ... 省略 ... f513 v513
OK
127.0.0.1:6379> object encoding hashkey
"hashtable"
```


