# Zset 有序集合

有序集合相对于字符串、列表、哈希、集合来说会有一些陌生。它保留了集合**不能有重复成员**的特点，但与集合不同的是，有序集合中的**每个元素都有一个唯一的浮点类型的分数（score）与之关联**，着使得有序集合中的元素是可以维护有序性的，但这个有序不是用下标作为排序依据而是用这个分数。

如下图所示，该有序集合显示了三国中的武将的武力。

![在这里插入图片描述](https://i-blog.csdnimg.cn/direct/628a3955ff304703a8342604013c369f.png)
有序集合提供了获取指定分数和元素范围查找、计算成员排名等功能，合理地利用有序集合，可
以帮助我们在实际开发中解决很多问题。

有序集合中的**元素是不能重复的，但分数允许重复**。类比于一次考试之后，每个人一定有一
个唯一的分数，但分数允许相同。

列表、集合、有序集合三者的异同点。
| 数据结构 | 是否允许重复元素 | 是否有序 | 有序依据 | 应用场景 |
| ---- | ---- | ---- | ---- | ---- |
| 列表 | 是 | 是 | 索引下标 | 时间轴、消息队列等 |
| 集合 | 否 | 否 | - | 标签、社交等 |
| 有序集合 | 否 | 是 | 分数 | 排行榜系统、社交等 |

## 普通命令
#### ZADD
添加或者更新指定的元素以及关联的分数到 zset 中，分数应该符合 double 类型，+inf/-inf 作为正负极限也是合法的。

- **语法**：`ZADD key [NX | XX] [GT | LT] [CH] [INCR] score member [score member ...]`
- ZADD 的相关选项:
	- XX：仅仅用于更新已经存在的元素，不会添加新元素。
	- NX：仅用于添加新元素，不会更新已经存在的元素。
	- GT ：仅当新分数大于当前分数时才更新现有元素。此标志不会阻止添加新元素。
	- LT ：仅当新分数小于当前分数时才更新现有元素。此标志不会阻止添加新元素。
	- CH：默认情况下，ZADD 返回的是本次添加的元素个数，但指定这个选项之后，就会还包含本次更新的元素个数。
	- INCR：此时命令类似 ZINCRBY 的效果，将元素的分数加上指定的分数。此时只能指定一个元素和分数。
- **命令有效版本**：1.2.0 之后
- **时间复杂度**：O(log(N))
- **返回值**：本次添加成功的元素个数。
- **示例**：
```
redis> ZADD myzset 1 "one"
(integer) 1
redis> ZADD myzset 1 "uno"
(integer) 1
redis> ZADD myzset 2 "two" 3 "three"
(integer) 2
redis> ZRANGE myzset 0 -1 WITHSCORES
1) "one"
2) "1"
3) "uno"
4) "1"
5) "two"
6) "2"
7) "three"
8) "3"
redis> ZADD myzset 10 one 20 two 30 three
(integer) 0
redis> ZRANGE myzset 0 -1 WITHSCORES
1) "uno"
2) "1"
3) "one"
4) "10"
5) "two"
6) "20"
7) "three"
8) "30"
redis> ZADD myzset CH 100 one 200 two 300 three
(integer) 3
redis> ZRANGE myzset 0 -1 WITHSCORES
1) "uno"
2) "1"
3) "one"
4) "100"
5) "two"
6) "200"
7) "three"
8) "300"
redis> ZADD myzset XX 1 one 2 two 3 three 4 four 5 five
(integer) 0
redis> ZRANGE myzset 0 -1 WITHSCORES
1) "uno"
2) "1"
3) "one"
4) "1"
5) "two"
6) "2"
7) "three"
8) "3"
9) "four"
10) "400"
11) "five"
12) "500"
redis> ZADD myzset INCR 10 one
(integer) 11
redis> ZRANGE myzset 0 -1 WITHSCORES
1) "uno"
2) "1"
3) "two"
4) "2"
5) "three"
6) "3"
7) "one"
8) "11"
9) "four"
10) "400"
11) "five"
12) "500"
redis> ZADD myzset -inf "negative_infinity" +inf "positive_infinity"
(integer) 2
redis> ZRANGE myzset 0 -1 WITHSCORES
1) "negative_infinity"
2) "-inf"
3) "uno"
4) "1"
5) "one"
6) "1"
7) "two"
8) "2"
9) "three"
10) "3"
11) "four"
12) "400"
13) "five"
14) "500"
15) "positive_infinity"
16) "+inf"
```

### ZCARD
获取一个 zset 的基数（cardinality），即 zset 中的元素个数。
- **语法**：`ZCARD key`
- **命令有效版本**：1.2.0 之后
- **时间复杂度**：O(1)
- **返回值**：zset 内的元素个数。
- **示例**：
```
redis> ZADD myzset 1 "one"
(integer) 1
redis> ZADD myzset 2 "two"
(integer) 1
redis> ZCARD myzset
(integer) 2
```

### ZCOUNT
返回分数在 min 和 max 之间的元素个数，默认情况下，min 和 max 都是包含的，可以通过(排除。
- **语法**：`ZCOUNT key min max`
- **命令有效版本**：2.0.0 之后
- **时间复杂度**：O(log(N))
- **返回值**：满足条件的元素列表个数。
- **示例**：
```
redis> ZADD myzset 1 "one"
(integer) 1
redis> ZADD myzset 2 "two"
(integer) 1
redis> ZADD myzset 3 "three"
(integer) 1
redis> ZCOUNT myzset -inf +inf
(integer) 3
redis> ZCOUNT myzset 1 3
(integer) 3
redis> ZCOUNT myzset (1 3
(integer) 2
redis> ZCOUNT myzset (1 (3
(integer) 1
```

### ZRANGE
返回指定区间里的元素，分数按照升序。带上 WITHSCORES 可以把分数也返回。
- **语法**：`ZRANGE key start stop [WITHSCORES]`
此处的 [start,stop] 为下标构成的区间. 从 0 开始, 支持负数.
- **命令有效版本**：1.2.0 之后
- **时间复杂度**：O(log(N)+M)
- **返回值**：区间内的元素列表。
- **示例**：
```
redis> ZADD myzset 1 "one"
(integer) 1
redis> ZADD myzset 2 "two"
(integer) 1
redis> ZADD myzset 3 "three"
(integer) 1
redis> ZRANGE myzset 0 -1 WITHSCORES
1) "one"
2) "1"
3) "two"
4) "2"
5) "three"
6) "3"
redis> ZRANGE myzset 0 -1
1) "one"
2) "two"
3) "three"
redis> ZRANGE myzset 2 3
1) "three"
redis> ZRANGE myzset -2 -1
1) "two"
2) "three"
```

### ZREVRANGE
返回指定区间里的元素，分数按照降序。带上 WITHSCORES 可以把分数也返回。
备注：这个命令可能在 6.2.0 之后废弃，并且功能合并到 ZRANGE 中。
- **语法**：`ZREVRANGE key start stop [WITHSCORES]`
- **命令有效版本**：1.2.0 之后
- **时间复杂度**：O(log(N)+M)
- **返回值**：区间内的元素列表。
- **示例**：
```
redis> ZADD myzset 1 "one"
(integer) 1
redis> ZADD myzset 2 "two"
(integer) 1
redis> ZADD myzset 3 "three"
(integer) 1
redis> ZREVRANGE myzset 0 -1 WITHSCORES
1) "three"
2) "3"
3) "two"
4) "2"
5) "one"
6) "1"
redis> ZREVRANGE myzset 0 -1
1) "three"
2) "two"
3) "one"
redis> ZREVRANGE myzset 2 3
1) "one"
redis> ZREVRANGE myzset -2 -1
1) "two"
2) "one"
```


### ZRANGEBYSCORE
返回分数在 min 和 max 之间的元素，默认情况下，min 和 max 都是包含的，可以通过(排除。
备注：这个命令可能在 6.2.0 之后废弃，并且功能合并到 ZRANGE 中。
- **语法**：`ZRANGEBYSCORE key min max [WITHSCORES]`
- **命令有效版本**：1.0.5 之后
- **时间复杂度**：O(log(N)+M)
- **返回值**：区间内的元素列表。
- **示例**：
```
redis> ZADD myzset 1 "one"
(integer) 1
redis> ZADD myzset 2 "two"
(integer) 1
redis> ZADD myzset 3 "three"
(integer) 1
redis> ZRANGEBYSCORE myzset -inf +inf
1) "one"
2) "two"
3) "three"
redis> ZRANGEBYSCORE myzset 1 2
1) "one"
2) "two"
redis> ZRANGEBYSCORE myzset (1 2
1) "two"
redis> ZRANGEBYSCORE myzset (1 (2
(empty array)
```

### ZPOPMAX
删除并返回分数最高的 count 个元素。
- **语法**：`ZPOPMAX key [count]`
- **命令有效版本**：5.0.0 之后
- **时间复杂度**：O(log(N) * M)
- **返回值**：分数和元素列表。
- **示例**：
```
redis> ZADD myzset 1 "one"
(integer) 1
redis> ZADD myzset 2 "two"
(integer) 1
redis> ZADD myzset 3 "three"
(integer) 1
redis> ZPOPMAX myzset
1) "three"
2) "3"
```

### BZPOPMAX
ZPOPMAX 的阻塞版本。
- **语法**：`BZPOPMAX key [key ...] timeout`
- **命令有效版本**：5.0.0 之后
- **时间复杂度**：O(log(N))
- **返回值**：元素列表。
- **示例**：
```
redis> DEL zset1 zset2
(integer) 0
redis> ZADD zset1 0 a 1 b 2 c
(integer) 3
redis> BZPOPMAX zset1 zset2 0
1) "zset1"
2) "c"
3) "2"
```

### ZPOPMIN
删除并返回分数最低的 count 个元素。
- **语法**：`ZPOPMIN key [count]`
- **命令有效版本**：5.0.0 之后
- **时间复杂度**：O(log(N) * M)
- **返回值**：分数和元素列表。
- **示例**：
```
redis> ZADD myzset 1 "one"
(integer) 1
redis> ZADD myzset 2 "two"
(integer) 1
redis> ZADD myzset 3 "three"
(integer) 1
redis> ZPOPMIN myzset
1) "one"
2) "1"
```

### BZPOPMIN
ZPOPMIN 的阻塞版本。
- **语法**：`BZPOPMIN key [key ...] timeout`
- **命令有效版本**：5.0.0 之后
- **时间复杂度**：O(log(N))
- **返回值**：元素列表。
- **示例**：
```
redis> DEL zset1 zset2
(integer) 0
redis> ZADD zset1 0 a 1 b 2 c
(integer) 3
redis> BZPOPMIN zset1 zset2 0
1) "zset1"
2) "a"
3) "0"
```

### ZRANK
返回指定元素的排名，升序。
- **语法**：`ZRANK key member`
- **命令有效版本**：2.0.0 之后
- **时间复杂度**：O(log(N))
- **返回值**：排名。
- **示例**：
```
redis> ZADD myzset 1 "one"
(integer) 1
redis> ZADD myzset 2 "two"
(integer) 1
redis> ZADD myzset 3 "three"
(integer) 1
redis> ZRANK myzset "three"
(integer) 2
redis> ZRANK myzset "four"
(nil)
```

### ZREVRANK
返回指定元素的排名，降序。
- **语法**：`ZREVRANK key member`
- **命令有效版本**：2.0.0 之后
- **时间复杂度**：O(log(N))
- **返回值**：排名。
- **示例**：
```
redis> ZADD myzset 1 "one"
(integer) 1
redis> ZADD myzset 2 "two"
(integer) 1
redis> ZADD myzset 3 "three"
(integer) 1
redis> ZREVRANK myzset "one"
(integer) 2
redis> ZREVRANK myzset "four"
(nil)
```

### ZSCORE
返回指定元素的分数。
- **语法**：`ZSCORE key member`
- **命令有效版本**：1.2.0 之后
- **时间复杂度**：O(1)
- **返回值**：分数。
- **示例**：
```
redis> ZADD myzset 1 "one"
(integer) 1
redis> ZSCORE myzset "one"
"1"
```

### ZREM
删除指定的元素。
- **语法**：`ZREM key member [member ...]`
- **命令有效版本**：1.2.0 之后
- **时间复杂度**：O(M*log(N))
- **返回值**：本次操作删除的元素个数。
- **示例**：
```
redis> ZADD myzset 1 "one"
(integer) 1
redis> ZADD myzset 2 "two"
(integer) 1
redis> ZADD myzset 3 "three"
(integer) 1
redis> ZREM myzset "two"
(integer) 1
redis> ZRANGE myzset 0 -1 WITHSCORES
1) "one"
2) "1"
3) "three"
4) "3"
```

### ZREMRANGEBYRANK
按照排序，升序删除指定范围的元素，左闭右闭。
- **语法**：`ZREMRANGEBYRANK key start stop`
- **命令有效版本**：2.0.0 之后
- **时间复杂度**：O(log(N)+M)
- **返回值**：本次操作删除的元素个数。
- **示例**：
```
redis> ZADD myzset 1 "one"
(integer) 1
redis> ZADD myzset 2 "two"
(integer) 1
redis> ZADD myzset 3 "three"
(integer) 1
redis> ZREMRANGEBYRANK myzset 0 1
(integer) 2
redis> ZRANGE myzset 0 -1 WITHSCORES
1) "three"
2) "3"
```

### ZREMRANGEBYSCORE
按照分数删除指定范围的元素，左闭右闭。
- **语法**：`ZREMRANGEBYSCORE key min max`
- **命令有效版本**：1.2.0 之后
- **时间复杂度**：O(log(N)+M)
- **返回值**：本次操作删除的元素个数。
- **示例**：
```
redis> ZADD myzset 1 "one"
(integer) 1
redis> ZADD myzset 2 "two"
(integer) 1
redis> ZADD myzset 3 "three"
(integer) 1
redis> ZREMRANGEBYSCORE myzset -inf (2
(integer) 1
redis> ZRANGE myzset 0 -1 WITHSCORES
1) "two"
2) "2"
3) "three"
4) "3"
```

### ZINCRBY
为指定的元素的关联分数添加指定的分数值。
- **语法**：`ZINCRBY key increment member`
- **命令有效版本**：1.2.0 之后
- **时间复杂度**：O(log(N))
- **返回值**：增加后元素的分数。
- **示例**：
```
redis> ZADD myzset 1 "one"
(integer) 1
redis> ZADD myzset 2 "two"
(integer) 1
redis> ZINCRBY myzset 2 "one"
"3"
redis> ZRANGE myzset 0 -1 WITHSCORES
1) "two"
2) "2"
3) "one"
4) "3"
```

### 集合间操作
![在这里插入图片描述](https://i-blog.csdnimg.cn/direct/254547e6788b487d8202cdcfe8f572c8.png)

#### ZINTERSTORE
求出**给定有序集合中元素的交集**并保存进目标有序集合中，在合并过程中以元素为单位进行合并，元素对应的分数按照不同的聚合方式和权重得到新的分数。
- **语法**：`ZINTERSTORE destination numkeys key [key ...] [WEIGHTS weight [weight ...]] [AGGREGATE <SUM | MIN | MAX>]`
- **命令有效版本**：2.0.0 之后
- **时间复杂度**：O(N*K)+O(M*log(M)) ，N 是输入的有序集合中，最小的有序集合的元素个数；K 是输入了几个有序集合；M 是最终结果的有序集合的元素个数。
- **返回值**：目标集合中的元素个数
- **示例**：
```
redis> ZADD zset1 1 "one"
(integer) 1
redis> ZADD zset1 2 "two"
(integer) 1
redis> ZADD zset2 1 "one"
(integer) 1
redis> ZADD zset2 2 "two"
(integer) 1
redis> ZADD zset2 3 "three"
(integer) 1
redis> ZINTERSTORE out 2 zset1 zset2 WEIGHTS 2 3
(integer) 2
redis> ZRANGE out 0 -1 WITHSCORES
1) "one"
2) "5"
3) "two"
4) "10"
```
![在这里插入图片描述](https://i-blog.csdnimg.cn/direct/d0ef8a43e05c4c77933ce102da22ffa4.png)




#### ZUNIONSTORE
求出给定有序集合中元素的并集并保存进目标有序集合中，在合并过程中以元素为单位进行合并，元素对应的分数按照不同的聚合方式和权重得到新的分数。
- **语法**：ZUNIONSTORE destination numkeys key [key ...] [WEIGHTS weight [weight ...]] [AGGREGATE <SUM | MIN | MAX>]
- **命令有效版本**：2.0.0 之后
- **时间复杂度**：O(N)+O(M*log(M)) ，N 是输入的有序集合总的元素个数；M 是最终结果的有序集合的元素个数。
- **返回值**：目标集合中的元素个数
- **示例**：
```
redis> ZADD zset1 1 "one"
(integer) 1
redis> ZADD zset1 2 "two"
(integer) 1
redis> ZADD zset2 1 "one"
(integer) 1
redis> ZADD zset2 2 "two"
(integer) 1
redis> ZADD zset2 3 "three"
(integer) 1
redis> ZUNIONSTORE out 2 zset1 zset2 WEIGHTS 2 3
(integer) 3
redis> ZRANGE out 0 -1 WITHSCORES
1) "one"
2) "5"
3) "three"
4) "9"
5) "two"
6) "10"
```

## 总结
| 命令 | 时间复杂度 |
| ---- | ---- |
| zadd key score member [score member ...] | O(k * log(n))，k 是添加成员的个数，n 是当前有序集合的元素个数 |
| zcard key | O(1) |
| zscore key member | O(1) |
| zrank key member、zrevrank key member | O(log(n))，n 是当前有序集合的元素个数 |
| zrem key member [member ...] | O(k * log(n))，k 是删除成员的个数，n 是当前有序集合的元素个数 |
| zincrby key increment member | O(log(n))，n 是当前有序集合的元素个数 |
| zrange key start end [withscores]、zrevrange key start end [withscores] | O(k + log(n))，k 是获取成员的个数，n 是当前有序集合的元素个数 |
| zrangebyscore key min max [withscores]、zrevrangebyscore key max min [withscores] | O(k + log(n))，k 是获取成员的个数，n 是当前有序集合的元素个数 |
| zcount | O(log(n))，n 是当前有序集合的元素个数 |
| zremrangebyrank key start end | O(k + log(n))，k 是获取成员的个数，n 是当前有序集合的元素个数 |
| zremrangebyscore key min max | O(k + log(n))，k 是获取成员的个数，n 是当前有序集合的元素个数 |
| zinterstore destination numkeys key [key ...] | O(n * k) + O(m * log(m))，n 是输入的集合最小的元素个数，k 是集合个数，m 是目标集合元素个数 |
| zunionstore destination numkeys key [key ...] | O(n) + O(m * log(m))，n 是输入集合总元素个数，m 是目标集合元素个数 |

## 内部编码
有序集合类型的内部编码有两种：
- **ziplist（压缩列表）**：当有序集合的元素个数小于 zset-max-ziplist-entries 配置（默认 128 个），同时每个元素的值都小于 zset-max-ziplist-value 配置（默认 64 字节）时，Redis 会用 ziplist 来作为有序集合的内部实现，ziplist 可以有效减少内存的使用。
- **skiplist（跳表）**：当 ziplist 条件不满足时，有序集合会使用 skiplist 作为内部实现，因为此时 ziplist 的操作效率会下降。
1. 当元素个数较少且每个元素较小时，内部编码为 ziplist：
```
127.0.0.1:6379> zadd zsetkey 50 e1 60 e2 30 e3
(integer) 3
127.0.0.1:6379> object encoding zsetkey
"ziplist"
```
2. 当元素个数超过 128 个，内部编码 skiplist：
```
127.0.0.1:6379> zadd zsetkey 50 e1 60 e2 30 e3 ... 省略 ... 82 e129
(integer) 129
127.0.0.1:6379> object encoding zsetkey
"skiplist"
```
3. 当某个元素大于 64 字节时，内部编码 skiplist：
```
127.0.0.1:6379> zadd zsetkey 50 "one string bigger than 64 bytes ... 省略 ..."
(integer) 1
127.0.0.1:6379> object encoding zsetkey
"skiplist"
```
